#### 📖 Terraform Plan ('infra-pe/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.dns.azurerm_private_dns_zone.private_dns_zones["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["blob"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["documents"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.documents.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["file"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "management.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["psql"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["queue"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.queue.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["redis"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "scm.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["servicebus"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["srch"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.search.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["table"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.table.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone.private_dns_zones["vault"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["blob"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["documents"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.documents.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["file"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "management.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["psql"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["queue"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.queue.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["redis"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "scm.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["servicebus"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["srch"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["table"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["vault"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-cgn-pe-vnet-01"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-itn-cgn-pe-rg-01"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_id    = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_SSL_ENABLED"     = "true"
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_URI"             = ""
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "NODE_ENV"                                        = "production"
          + "SERVER_PORT"                                     = "8080"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"             = "false"
          + "WEBSITES_PORT"                                   = "8080"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_NODE_DEFAULT_VERSION"                    = "18.13.0"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-cgn-pe-attribute-authority-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-cgn-pe-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_SSL_ENABLED"     = "true"
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_URI"             = ""
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "NODE_ENV"                                        = "production"
          + "SERVER_PORT"                                     = "8080"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"             = "false"
          + "WEBSITES_PORT"                                   = "8080"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_NODE_DEFAULT_VERSION"                    = "18.13.0"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-itn-cgn-pe-attribute-authority-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-itn-cgn-pe-rg-01"
      + sku_name                     = "P0v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.26.0.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-cgn-pe-attribute-authority-app-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-cgn-pe-rg-01"
      + virtual_network_name                           = "io-p-itn-cgn-pe-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

Error: Private Dns Zone (Subscription: "74da48a3-b0e7-489d-8172-da79801086ed"
Resource Group Name: "io-p-itn-cgn-pe-rg-01"
Private Dns Zone Name: "privatelink.azurewebsites.net") was not found

  with module.app_service_attribute_authority.module.app_service_attribute_authority.data.azurerm_private_dns_zone.app_service,
  on .terraform/modules/app_service_attribute_authority.app_service_attribute_authority/infra/modules/azure_app_service/data.tf line 6, in data "azurerm_private_dns_zone" "app_service":
   6: data "azurerm_private_dns_zone" "app_service" {

::error::Terraform exited with code 1.
```

</details>
